In [ ]:
python installlation
basic syntax
library import
python data types

In [ ]:
string basics

In [1]:
name = "thillai murali"

In [2]:
type(name)

str

In [ ]:
name.TAB button press

In [22]:
desc = "the metal iron rod is used in the manufacturing assembly line"
        01234

In [21]:
type(desc)

str

In [23]:
desc.find('metal')

4

In [24]:
desc.find('iron')

10

In [3]:
name.capitalize()

'Thillai murali'

In [4]:
name

'thillai murali'

In [5]:
name.casefold()

'thillai murali'

In [8]:
name.find('l')

3

In [ ]:
thillai murali
0123

In [9]:
name.casefold()

'thillai murali'

In [10]:
name.islower()

True

In [11]:
name.isnumeric()

False

In [28]:
name
# name.isupper()

'thillai murali'

In [25]:
name.upper()

'THILLAI MURALI'

In [44]:
name[0:2].upper()

'TH'

In [15]:
fname = 'thillai'

In [16]:
lname = 'murali'

In [39]:
fname + lname

'thillaimurali'

In [40]:
fname + ' ' + lname

'thillai murali'

In [19]:
fname + '@' + lname

'thillai@murali'

In [29]:
len(name) - variable name

14

In [32]:
desc = 'the metal iron metal rod is used in the manufacturing assembly line'

In [33]:
desc.count('metal')

2

In [36]:
len(desc)

67

In [37]:
desc

'the metal iron metal rod is used in the manufacturing assembly line'

In [38]:
desc.count('metal')

2

In [ ]:
len - over all count
count - parameter count

In [ ]:
python conditional sttatements

a == b
a != b
a < b
a > b
a <= b

In [ ]:
syntax

if cond:
    sttaement  - indent  , indentation ( 4 space)
else:
    sttatment
    
a = 5
b = 10
if cond:
    a==b

In [45]:
a = 10
b = 5
if a>b:
    print("a is greater")
else:
    print("b is greater")

a is greater

In [46]:
a = 5
b = 10
if a>b:
    print("a is greater")
else:
    print("b is greater")

b is greater

In [47]:
a = 5
b = 5

if a>b:
    print("a is greater than b")
elif a == b:
    print("a and b are same")
elif a<b:
    print("a < b")
    .
    .
    .
    
else:
    print('b is greater')

a and b are same

In [52]:
a = 200
b = 33
c = 500

if a>b and c==a:
    print("both cond are true")
else:
    print('cond is failed')

cond is failed

In [50]:
if a>b or c==a:
    print("atleat one cond are true")
else:
    print('cond is failed')

atleat one cond are true

In [53]:
name = input("enter ur name")

enter ur namerajini

In [54]:
name

'rajini'

In [55]:
type(name)

str

In [59]:
x = input().split()

12 14 16 18

In [60]:
x

['12', '14', '16', '18']

In [65]:
print(' '.join(x))

12 14 16 18

In [61]:
x

['12', '14', '16', '18']

In [64]:
'%'.join(x)

'12%14%16%18'

In [ ]:
# Python for loop

syntax

for i in (python data type):
    sttatment

In [70]:
lis = ['Tree','wood','fruits',1,2,3]

In [71]:
lis

['Tree', 'wood', 'fruits', 1, 2, 3]

In [72]:
len(lis)

6

In [74]:
for i in lis:(0,1,2,3,4,5)
    print(i)

Tree
wood
fruits
1
2
3

In [75]:
for i in range(0,5):
    print(i)

0
1
2
3
4

In [76]:
for i in range(5):
    print(i)

0
1
2
3
4

In [77]:
for i in range(2,15):
    print(i)

2
3
4
5
6
7
8
9
10
11
12
13
14

In [85]:
# nested loop 

legends = ['rajini','kamal','vikram']
dependents = ['tamil movie1','hindi movie2','telugu']

In [86]:
for x in legends:
    for y in dependents:
        print(x,y)

rajini tamil movie1
rajini hindi movie2
rajini telugu
kamal tamil movie1
kamal hindi movie2
kamal telugu
vikram tamil movie1
vikram hindi movie2
vikram telugu

In [87]:
lis

['Tree', 'wood', 'fruits', 1, 2, 3]

In [88]:
for i  in lis:
    if i == 'fruits':
        print("fruits is there in the list")

fruits is there in the list

In [89]:
i = 1
while i < 6:
    print(i) 
    i = i+1

1
2
3
4
5

In [ ]:
task:
    
1.odd number print odd no , even number print(even numer)

In [ ]:
5 print(odd)  , 6 - print(even)   , input -> 1 - 30

In [ ]:
two wheeler drive road

1.red   print(stop)
2.green  print(go)
3.yellow print(ready)

quitent , remider

In [90]:
for i in range(1,31):
    if i % 2 == 0:                
        print(i,"even")
    else:
        print(i,"odd")

1 odd
2 even
3 odd
4 even
5 odd
6 even
7 odd
8 even
9 odd
10 even
11 odd
12 even
13 odd
14 even
15 odd
16 even
17 odd
18 even
19 odd
20 even
21 odd
22 even
23 odd
24 even
25 odd
26 even
27 odd
28 even
29 odd
30 even

In [95]:
a= input("please enter (red, green, yellow): ")
if a.lower()=="red":
    print("stop")
elif a.lower()=="green":
    print("go")
else:
    print("ready")

please enter (red, green, yellow): black
ready

In [97]:
n = input()
if n.lower() == 'red':
    print('stop')
elif n.lower() == 'green':
    print('go')
elif n.lower() == 'yellow':
    print('wait')
else:
    print("Enter a valid input next time")

GreEN
go

In [98]:
4 % 2 Reminder even odd

0

In [104]:
n = 6
if n % 2==0:
    print("even")
else:
    print("odd")

even

In [ ]:
functions

numeric function
string funtion

In [108]:
name = "MURALI"

In [106]:
name.center(20)

'       murali       '

In [109]:
name.casefold() - lower case

'murali'

In [ ]:
numeric function

In [110]:
import math

In [111]:
math.lcm(3,4,5)

60

In [112]:
math.ceil(89.55)

90

In [113]:
math.exp(8)

2980.9579870417283

In [114]:
math.log(78)

4.356708826689592

In [ ]:
string fucntion  - lower, upper , casfold , capitl ,....
numeric function - log, power, exp , sin , cos , tan , math.funciton, square,sqrt

In [115]:
name = "abi"

In [116]:
name.lower()

'abi'

In [117]:
name.upper()

'ABI'

In [ ]:
customs functions - user willing to create

In [ ]:
syntax:
    
    def functionname(p1,p2,...):
        statement
        return Values

In [ ]:
def project(patientid,date,disease):
    rules1 - date > 8999 then pateinet next date
    rule -> dieseae fever then next symptoms
    rule 3-> fever convert jaundice
    
    return patientid, rules

project(23jjfjf,02/04/23,'fever')

In [118]:
def rajini():
    x = 3
    y = 5
    z = x+y
    return z

In [119]:
rajini()

8

In [120]:
def kamal(fname,lname,mname):
    res = fname + lname + mname
    
    return res

In [121]:
kamal("guvi","python")

'guvipython'

In [122]:
kamal("thillai","murali")

'thillaimurali'

In [123]:
kamal("5","9")

'59'

In [ ]:
y = a+bx

y = 5 + 10x

In [128]:
def line(a,b,x):
    y = a + b * x
    return y,a,b

In [129]:
line(1,2,3) , line(7,6,9)

((7, 1, 2), (61, 7, 6))

In [ ]:
task1:

    y = 5x2 + 16x + 20

In [1]:
# import numpy
def parabola(x):
    y = 5*(x**2)+16*x+20
    return y

In [2]:
parabola(2)

72

In [143]:
def para(a,x,b,c):
    y = a*(x**2)+b*x+c
    return y

In [144]:
para(1,2,3,4)

14

In [ ]:
task 1:
    fucntion  education details , 10th mark 300 > gradeb , >400 grade b , < 30 fail

In [145]:
# Common errors in python

In [146]:
x = 8

In [147]:
x

8

In [149]:
z = 9

In [150]:
z

9

In [152]:
salary

NameError: name 'salary' is not defined

In [153]:
if 2>4:
print("yes")

IndentationError: expected an indented block (3594652557.py, line 2)

In [154]:
if "thillai"/2:
    print("yes")

TypeError: unsupported operand type(s) for /: 'str' and 'int'

In [156]:
iff 4+5:
    print("yes")

SyntaxError: invalid syntax (588381360.py, line 1)

In [158]:
x = int(input())

Thillai

ValueError: invalid literal for int() with base 10: 'Thillai'

In [ ]:
debugging - errors

# list comprehension

In [159]:
lis = ["apple","orange","mango"]

In [160]:
lis[0]

'apple'

In [162]:
lis[1]

'orange'

In [163]:
surya = [1,2,3,"ljfsdlf3244"]

In [167]:
surya[0:2]

[1, 2]

In [171]:
surya.extend([6])

In [172]:
surya

[1, 2, 3, 'ljfsdlf3244', 5, 6]

In [174]:
surya.append('insert')

In [175]:
surya

[1, 2, 3, 'ljfsdlf3244', 5, 6, 'insert']

In [176]:
lis

['apple', 'orange', 'mango']

In [177]:
surya

[1, 2, 3, 'ljfsdlf3244', 5, 6, 'insert']

In [179]:
lis.extend(surya)

In [180]:
lis

['apple', 'orange', 'mango', 1, 2, 3, 'ljfsdlf3244', 5, 6, 'insert']

In [182]:
v = [ "wheet","rice","grams" ]

In [183]:
type(v)  [    ]

list

In [ ]:
Advantange:
    1.more time efficient and space efficeint than loops
    2.fewer line of code
    3.iteration or looping

In [ ]:
syntax of list comprehension:
    
    newlist = [  expression(element) for element in oldlist if condition  ]

In [186]:
# Even number 

even = [i for i in range(1,31) if i %2 == 0]

In [187]:
even

[2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30]

In [188]:
lis = [ "even number" if i %2 ==0 else "odd number" for i in range(8)  ]

In [189]:
lis

['even number',
 'odd number',
 'even number',
 'odd number',
 'even number',
 'odd number',
 'even number',
 'odd number']

In [218]:
lis1 = [ j for j in range(100)  if j % 5 ==0  if j % 10 ==0 ]

In [219]:
lis1

[0, 10, 20, 30, 40, 50, 60, 70, 80, 90]

In [222]:
new = [ string[::-1]  for string in  ('malayalam','madam','geeks')  ]

In [224]:
new

['malayalam', 'madam', 'skeeg']

In [225]:
def parabola(x):
    y = 5*(x**2)+16*x+20
    return y

In [226]:
newlist = [ parabola(i) for i in range(10)]

In [227]:
newlist

[20, 41, 72, 113, 164, 225, 296, 377, 468, 569]

In [228]:
# Import required module
import time
# define function to implement for loop
def for_loop(n):
	result = []
	for i in range(n):
		result.append(i**2)
	return result

# define function to implement list comprehension
def list_comprehension(n):
	return [i**2 for i in range(n)]
# Driver Code
# Calculate time taken by for_loop()
begin = time.time()
for_loop(10**6)
end = time.time()

# Display time taken by for_loop()
print('Time taken for_loop:', round(end-begin, 2))

# Calculate time takens by list_comprehension()
begin = time.time()
list_comprehension(10**6)
end = time.time()

# Display time taken by for_loop()
print('Time taken for list_comprehension:', round(end-begin, 2))

Time taken for_loop: 0.53
Time taken for list_comprehension: 0.44

In [ ]:
def for_loop(n):
	result = []
	for i in range(n):
		result.append(i**2)
	return result

def list_comprehension(n):
	return [i**2 for i in range(n)]

# file handling

In [ ]:
file handling - how we can read , write , append

In [ ]:
syntax:
file = open(filename , mode)

In [ ]:
r- open a existing file ( read)
w - open existing file for write purpose (write)
a  - open file for appending purpose ( append)

In [240]:
file = open('sample.txt','r')

In [242]:
file

In [241]:
print(file.read())

Name	age	mobile no	city	marks	salary
A	50	9900763290	Bangalore	285	10818
B	23	9709303020	Mumbai	434	12344
C	22	9796840335	pune	416	11506
D	47	9433821160	chennai	189	15249
E	33	9840448035	Bangalore	117	13072
F	59	9626621256	chennai	326	18206
G	21	9775317986	hydrabad	467	13755
H	28	9798357363	calcatta	401	15539
I	37	9338865840	pune	487	11339
J	50	9427086263	Mumbai	265	19676

In [238]:
import os
os.chdir('C:\\Users\\Admin\\Desktop\\project\\BA\\week 1')

In [239]:
os.getcwd()

'C:\\Users\\Admin\\Desktop\\project\\BA\\week 1'

In [ ]:
path define

1.r'C:\Users\Admin\Desktop\project\BA\week 1'
2.C:\\Users\\Admin\\Desktop\\project\\BA\\week 1
3.C:/Users/Admin/Desktop/project/BA/week 1

In [237]:
print(file.read())

Name	age	mobile no	city	marks	salary
A	50	9900763290	Bangalore	285	10818
B	23	9709303020	Mumbai	434	12344
C	22	9796840335	pune	416	11506
D	47	9433821160	chennai	189	15249
E	33	9840448035	Bangalore	117	13072
F	59	9626621256	chennai	326	18206
G	21	9775317986	hydrabad	467	13755
H	28	9798357363	calcatta	401	15539
I	37	9338865840	pune	487	11339
J	50	9427086263	Mumbai	265	19676

In [ ]:
class and objects

In [ ]:
syntax:
    class classname:
        sttatment

In [ ]:
steps 

1.line eqn
2.parabola eqn
3.string combine

In [ ]:
class - we can create multiple objects

In [3]:
# Example

class msdhoni:
    
    def line(a,b,x):
        y = a + b*x 
        return y
    def parabola(a,x,b,c):
        z = a*(x**2)+b*x+c
        return z
    def combine(fname,lname):
        cc = fname + lname
        return cc

In [8]:
msdhoni.line(1,2,3)

7

In [4]:
rajini = msdhoni

In [5]:
rajini.line(1,2,3)

7

In [6]:
rajini.parabola(1,2,3,4)

14

In [7]:
rajini.combine("thillai","murali")

'thillaimurali'

In [ ]:
steps 

1.line eqn   - y = a+bx
2.parabola eqn  -> y = ax2+bx+c
3.string combine -> fname + lname

In [15]:
class google:
    
    def __init__(self,name,age):
        self.name = name
        self.age = age
        
    def hello(self):
        print("myname is ",self.name,self.age)

In [16]:
p = google("sachin",24)

In [17]:
p.hello()

myname is  sachin 24

In [ ]:
Task 1 :
    prime numers 1 to 100 , using for loop or list comprehnsion
    create class with your family detail , education , work exp..

In [15]:
import pickle  (pickling)

In [ ]:
csv , .xlsx - excel document

In [ ]:
.pkl ( storing a large volume of file in our local )

In [ ]:
50 lakhs records .pkl compress save , excel , csv .txt

In [ ]:
upper , lower , capilize , casefold ,  ...

In [ ]:
custom funciton

def funcname(p1,..)
    sttt
    return true

# python lambda fucntion

In [ ]:
lambda - anonymoous function , opeartion - 1

In [16]:
string = "python"

In [19]:
upp(string)

'PYTHON'

In [20]:
name = "thillai"
name22 = "murali"

In [ ]:
upp = lambda x: x.upper()

In [21]:
upp(name)

'THILLAI'

In [23]:
upp(name22)

'MURALI'

In [24]:
max1 = lambda a,b : a if a>b else b

In [25]:
max1(1,2)

2

In [26]:
max1(9,4)

9

In [ ]:
syntax:
    lamba expressio : operation

In [27]:
li = [5,6,7,88,99]

In [18]:
xx = list(filter(lambda x:x % 2 ==0,li))

NameError: name 'li' is not defined

In [31]:
xx

[6, 88]

In [32]:
list(map(lambda x:x*2,li))

[10, 12, 14, 176, 198]

In [14]:
# map(str.lower,"thillai")

In [19]:
import json

In [20]:
x =  '{ "name":"John", "age":30, "city":"New York"}'

In [21]:
y = json.loads(x)

In [23]:
# json to python

y['age']

30

In [24]:
y['city']

'New York'

In [25]:
y['name']

'John'

In [9]:
# convert json to python

import json

# some JSON:
x =  '{ "name":"John", "age":30, "city":"New York"}'

# parse x:
y = json.loads(x)

# the result is a Python dictionary:
print(y["age"])

30

In [26]:
x = {
  "name": "John",
  "age": 30,
  "city": "New York"
}

In [27]:
type(x)

dict

In [28]:
# convert python to json
import json

# a Python object (dict):
x = {
  "name": "John",
  "age": 30,
  "city": "New York"
}

# convert into JSON:
y = json.dumps(x)

# the result is a JSON string:
print(y)

{"name": "John", "age": 30, "city": "New York"}

In [29]:
import json

print(json.dumps({"name": "John", "age": 30}))
print(json.dumps(["apple", "bananas"]))
print(json.dumps(("apple", "bananas")))
print(json.dumps("hello"))
print(json.dumps(42))
print(json.dumps(31.76))
print(json.dumps(True))
print(json.dumps(False))
print(json.dumps(None))

{"name": "John", "age": 30}
["apple", "bananas"]
["apple", "bananas"]
"hello"
42
31.76
true
false
null

In [ ]:
json , load , dump 

convert to python
python to json

In [32]:
# # import json
# json.loads('df.json')

In [33]:
tup = ("apple","orange","mango")

In [34]:
tup

('apple', 'orange', 'mango')

In [48]:
iter1 = iter(tup)
iter1

In [47]:
print(next(iter1))

mango

In [49]:
print(next(iter1))
print(next(iter1))
print(next(iter1))

apple
orange
mango

In [35]:
type(tup)

tuple

In [37]:
iter1 = iter(tup)

In [36]:
for i in tup:
    print(i)

apple
orange
mango

In [1]:
# Python 3 program for recursive binary search.

def binary_search(arr, low, high, x):

# Check base case
    if high >= low:

        mid = (high + low) // 2


		if arr[mid] == x:
			return mid

		# If element is smaller than mid, then it can only
		# be present in left subarray
		elif arr[mid] > x:
			return binary_search(arr, low, mid - 1, x)

		# Else the element can only be present in right subarray
		else:
			return binary_search(arr, mid + 1, high, x)

	else:
		# Element is not present in the array
		return -1

In [6]:
# Test array
arr = [ 2, 3, 4, 10, 40 ]
x = 20

# Function call
result = binary_search(arr, 0, len(arr)-1, x)

if result != -1:
	print("Element is present at index", str(result))
else:
	print("Element is not present in array")

Element is not present in array

In [7]:
len(arr)-1

4

In [ ]:
Task1:
    
1.creat list with grocerry details
2.conditonal statmetn , pythogrss , AC^2 = AB^2 + BC^2

A and C gt AC^2 print
B or C gt AB^2 print
C gt , print(C)

3.looping prime numbers upto 100 , print(even) & odd
4.taks 3 need to do with list comprehension
5.ab = log(x) + sin(y) + tan(z)  - function
6.tan(y) = sin(x) / cos(z) - function
7.1 / 1- r^2  function
8.distance  = sqrt (  x1-x2 ^2 + y1-y2 ^2 ) function
9.class object ( task 5-8)
10.lambda b^2 - 4ac / 2a
11.string phone fetch - regex exp

In [ ]:
class & objects - regular routine ( brush , bath , food , work , education , sleeping)

In [ ]:
class bsc  -100

maths
science
social
economicas



class be   - 200

eee,ece,mech,IT,...


class ba  

engilis, tamil , history,...

In [ ]:
class name(p1,p2,...):
    
    def maths
    best
    
    def science
    avergae
    
    def social
    excellent
    ...

In [ ]:
class maths:
        
        def sqrt(x,y,z):
            x = y * z
            return x
        
        
        def cube(a,b)
        
            v = a^3
            return v

In [ ]:
cc = maths
cc.cube(1,4)
cc.sqrt(8,9)

In [ ]:
lambda : anonyms , small operation we will use lambda

In [1]:
suma = lambda a,b : a+b

In [2]:
suma(1,2)

3

In [3]:
suma(4,5)

9

In [ ]:
lambda  arguments : calculation ( if else , condition , string function)

In [9]:
import numpy
y = lambda x: numpy.sqrt(x)

In [11]:
y(9)

3.0

In [13]:
list1 = [1,2,3,4,5,6,7,89,10]

In [ ]:
filter , map - lambda apply to object

In [ ]:
list(map(function , object))

In [16]:
list(map(lambda x:numpy.sqrt(x),list1))

[1.0,
 1.4142135623730951,
 1.7320508075688772,
 2.0,
 2.23606797749979,
 2.449489742783178,
 2.6457513110645907,
 9.433981132056603,
 3.1622776601683795]

In [17]:
min1 = lambda x,y : x if (x>y) else y

In [18]:
min1(3,4)

4

In [ ]:
import json

object to json format
python to json
json to python

In [ ]:
json.dump()

In [ ]:
json.loads()

In [ ]:
shuffle - reverse

In [ ]:
truncate

In [22]:
x = '    thillai     '

In [23]:
x.strip()

'thillai'

In [24]:
x.casefold() - upper to lower case

'    thillai     '

In [25]:
x = [1,2,3,4,"a","b","c"]

In [26]:
x[0]

1

In [27]:
x[4:5]

['a']

In [28]:
x[1:4]

[2, 3, 4]

In [29]:
y = ["x","y"]

In [30]:
x.extend(y)

In [31]:
x

[1, 2, 3, 4, 'a', 'b', 'c', 'x', 'y']

In [32]:
x.append(y)

In [33]:
x

[1, 2, 3, 4, 'a', 'b', 'c', 'x', 'y', ['x', 'y']]

In [35]:
x.remove('a')

In [36]:
x

[1, 2, 3, 4, 'b', 'c', 'x', 'y', ['x', 'y']]

In [40]:
range(0,6,2)

range(0, 6, 2)

In [42]:
for i in range(0,10):
    print(9*i)

0
9
18
27
36
45
54
63
72
81

In [43]:
import pandas

In [44]:
data = pandas.read_csv(r'C:\Users\Admin\Desktop\project\BA\week 1\store2.csv')

In [46]:
data = pandas.read_csv(r'C:\Users\Admin\Desktop\project\BA\week 1\store2.csv',sep=",")

In [58]:
text = pandas.read_csv(r"C:\Users\Admin\Desktop\project\BA\week 1\sample 3.txt",sep="@")

In [59]:
text

  Name  age   mobile no       city  marks  salary
0    A   50  9900763290  Bangalore    285   10818
1    B   23  9709303020     Mumbai    434   12344
2    C   22  9796840335       pune    416   11506
3    D   47  9433821160    chennai    189   15249
4    E   33  9840448035  Bangalore    117   13072
5    F   59  9626621256    chennai    326   18206
6    G   21  9775317986   hydrabad    467   13755
7    H   28  9798357363   calcatta    401   15539
8    I   37  9338865840       pune    487   11339
9    J   50  9427086263     Mumbai    265   19676

In [48]:
pandas.read_json("filname.json")

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit,rk
9689,3348,CA-2015-112014,8/13/2015,42236,Standard Class,ON-18715,Odella Nelson,Corporate,United States,Yucaipa,...,West,OFF-AR-10003156,Office Supplies,Art,50 Colored Long Pencils,50.800,5,0.0,13.2080,1
9690,8088,CA-2016-106621,9/29/2016,42644,Second Class,DM-12955,Dario Medina,Corporate,United States,Yuma,...,West,OFF-AR-10002375,Office Supplies,Art,Newell 351,10.496,4,0.2,1.1808,1
9691,4823,CA-2016-134222,7/10/2016,42562,Same Day,NZ-18565,Nick Zandusky,Home Office,United States,Yuma,...,West,OFF-BI-10001658,Office Supplies,Binders,GBC Standard Therm-A-Bind Covers,44.856,6,0.7,-35.8848,2
9692,7280,CA-2016-108224,5/14/2016,42504,Same Day,TH-21235,Tiffany House,Corporate,United States,Yuma,...,West,TEC-AC-10003832,Technology,Accessories,Imation16GB Mini TravelDrive USB 2.0Flash Drive,185.528,7,0.2,48.7011,3
9693,7282,CA-2017-159282,10/16/2017,43029,Standard Class,GH-14410,Gary Hansen,Home Office,United States,Yuma,...,West,TEC-MA-10001148,Technology,Machines,Swingline SM12-08 MicroCut Jam Free Shredder,599.985,5,0.7,-479.9880,4

In [49]:
data.to_excel("output.xlsx")

In [55]:
data.to_json("file.json")

In [63]:
import pandas as pd
df1 = pd.DataFrame({'Race100':[1,2,3] ,  'Race200':[4,5,6] , 'Race300':[7,8,9]
                    })

In [64]:
def avgspped(x,y,z):
    if x+y+z / 3

   Race100  Race200  Race300
0        1        4        7
1        2        5        8
2        3        6        9

In [80]:
def average_speed_calculator(x,y,z):
        # Get the value of spinbox using get() method
        # Hours
    hrs = int(x)
    # minutes
    mins = int(y)
    # distance
    dist = int(z)
 
    # Formula Used
    value = dist/(hrs+(mins/60))
    return value
 
    import pandas as pd
df1 = pd.DataFrame({'Race100':[100] ,  'Race200':[200] , 'Race300':[300]
                    })

In [81]:
df1['Race100'],df1['Race200'],df1['Race300']

(0    100
 Name: Race100, dtype: int64,
 0    200
 Name: Race200, dtype: int64,
 0    300
 Name: Race300, dtype: int64)

In [82]:
average_speed_calculator(df1['Race100'],df1['Race200'],df1['Race300'])

2.903225806451613

In [83]:
def expression(string):
    if string in '+':
        print("yes")

In [84]:
expression("4+5")

In [86]:
string = "4+5"
if string in '4':
    print("yes")

In [93]:
string = "4+5"

In [94]:
string

'4+5'

In [96]:
string in

False

In [97]:
name = "thillai"

In [102]:
s= 'x11y3'

In [105]:
split = re.findall("\d+",s)

In [115]:
int(split[0]) * s[0] + int(split[1]) * s[3]

'xxxxxxxxxxxyyy'

In [112]:
s[0]

'x'

In [128]:
s = '4+5'

'5'

In [125]:
int(s[0]) + int(s[2])

9

In [134]:
x = (s.replace(s,'-'))

In [171]:
def operations(string):
    a = (string.replace('-',''))
    s = (string.replace('+',''))
    m = (string.replace('*',''))
    d = (string.replace('/',''))
    
    if int(a) > 0:
        print(int(string[0]) - int(string[2]))
    if int(s) > 0:
        print(int(string[0]) + int(string[2]))
    if int(m) >0:
        print(int(string[0]) * int(string[2]))
    if int(d) >0:
        print(int(string[0]) / int(string[2]))

In [177]:
import numpy as np
np.exp(625)


5**4 = 625

625

In [190]:
x = 625
y = 5
for i in range(0,9):
    if x / y ** i == 1:
        print(i)

2

In [170]:
a = (string.replace('-',''))
string
if int(a)  > 0:
    print(int(string[0]) - int(string[2]))

8

In [169]:
int(string[0]) - int(string[2])

8

In [155]:
string = '8-0'

In [212]:
data[:2]

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit,rk
0,9261,CA-2017-167976,11/11/2017,43053,Second Class,JL-15505,Jeremy Lonsdale,Consumer,United States,Aberdeen,...,Central,OFF-SU-10004661,Office Supplies,Supplies,Acme Titanium Bonded Scissors,25.500,3,0.0,6.6300,1
1,6990,CA-2017-165099,12/11/2017,43082,First Class,DK-13375,Dennis Kane,Consumer,United States,Abilene,...,Central,OFF-AP-10001634,Office Supplies,Appliances,Hoover Commercial Lightweight Upright Vacuum,1.392,2,0.8,-3.7584,1

In [ ]:
import pandas
data = pandas.read_csv("store.csv")

In [213]:
data

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit,rk
0,9261,CA-2017-167976,11/11/2017,43053,Second Class,JL-15505,Jeremy Lonsdale,Consumer,United States,Aberdeen,...,Central,OFF-SU-10004661,Office Supplies,Supplies,Acme Titanium Bonded Scissors,25.500,3,0.0,6.6300,1
1,6990,CA-2017-165099,12/11/2017,43082,First Class,DK-13375,Dennis Kane,Consumer,United States,Abilene,...,Central,OFF-AP-10001634,Office Supplies,Appliances,Hoover Commercial Lightweight Upright Vacuum,1.392,2,0.8,-3.7584,1
2,4324,US-2015-147662,2/14/2015,42054,Standard Class,KB-16315,Karl Braun,Consumer,United States,Akron,...,East,OFF-BI-10002160,Office Supplies,Binders,Acco Hanging Data Binders,2.286,2,0.7,-1.6764,1
3,3563,CA-2017-109757,9/4/2017,42987,Second Class,MD-17350,Maribeth Dona,Consumer,United States,Akron,...,East,OFF-BI-10001634,Office Supplies,Binders,Wilson Jones Active Use Binders,4.368,2,0.7,-3.0576,2
4,9922,CA-2014-111360,11/24/2014,41973,Standard Class,AT-10435,Alyssa Tate,Home Office,United States,Akron,...,East,OFF-BI-10003350,Office Supplies,Binders,Acco Expandable Hanging Binders,5.742,3,0.7,-4.5936,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9689,3348,CA-2015-112014,8/13/2015,42236,Standard Class,ON-18715,Odella Nelson,Corporate,United States,Yucaipa,...,West,OFF-AR-10003156,Office Supplies,Art,50 Colored Long Pencils,50.800,5,0.0,13.2080,1
9690,8088,CA-2016-106621,9/29/2016,42644,Second Class,DM-12955,Dario Medina,Corporate,United States,Yuma,...,West,OFF-AR-10002375,Office Supplies,Art,Newell 351,10.496,4,0.2,1.1808,1
9691,4823,CA-2016-134222,7/10/2016,42562,Same Day,NZ-18565,Nick Zandusky,Home Office,United States,Yuma,...,West,OFF-BI-10001658,Office Supplies,Binders,GBC Standard Therm-A-Bind Covers,44.856,6,0.7,-35.8848,2
9692,7280,CA-2016-108224,5/14/2016,42504,Same Day,TH-21235,Tiffany House,Corporate,United States,Yuma,...,West,TEC-AC-10003832,Technology,Accessories,Imation16GB Mini TravelDrive USB 2.0Flash Drive,185.528,7,0.2,48.7011,3
9693,7282,CA-2017-159282,10/16/2017,43029,Standard Class,GH-14410,Gary Hansen,Home Office,United States,Yuma,...,West,TEC-MA-10001148,Technology,Machines,Swingline SM12-08 MicroCut Jam Free Shredder,599.985,5,0.7,-479.9880,4

In [214]:
import pandas as pd

In [215]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [216]:
s , NaN  - Not a number , string - blanks , date - NaT  - Not a time

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [195]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [219]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float"),
        "D": np.array([3] * 4, dtype="int"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "sample",
    }
)

In [220]:
df2  - mixing of all the values , number , string , date , categorical - multi - dimension

A,B,C,D,...
0,1,2 - index

     A          B    C  D      E       F
0  1.0 2013-01-02  1.0  3   test  sample
1  1.0 2013-01-02  1.0  3  train  sample
2  1.0 2013-01-02  1.0  3   test  sample
3  1.0 2013-01-02  1.0  3  train  sample

In [224]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [197]:
df2.TAB button

'a'

In [225]:
df2.describe()

         A    C    D
count  4.0  4.0  4.0
mean   1.0  1.0  3.0
std    0.0  0.0  0.0
min    1.0  1.0  3.0
25%    1.0  1.0  3.0
50%    1.0  1.0  3.0
75%    1.0  1.0  3.0
max    1.0  1.0  3.0

In [200]:
list1[4] * 2

4

In [205]:
prime = [i for i in range(2, 101) if all(i % j != 0 for j in range(2, i))]
print(prime)

# if all(i % j != 0 for j in range(2, i))] - this in particula

[2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 79, 83, 89, 97]

In [ ]:
import pandas as pd

In [226]:
pd.Series([1,23,5,6])

0     1
1    23
2     5
3     6
dtype: int64

In [229]:
pd.DataFrame( { "name" : "thillai" , "salary" : 455 , index = 0})

SyntaxError: invalid syntax (4119468934.py, line 1)

In [ ]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float"),
        "D": np.array([3] * 4, dtype="int"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "sample",
    }
)

In [230]:
df3 = pd.DataFrame( { "name": "thillai" , "salary" : [100] } )

In [231]:
df3

      name  salary
0  thillai     100

In [236]:
# data frame ops

data.head() 

# data struture

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit,rk
0,9261,CA-2017-167976,11/11/2017,43053,Second Class,JL-15505,Jeremy Lonsdale,Consumer,United States,Aberdeen,...,Central,OFF-SU-10004661,Office Supplies,Supplies,Acme Titanium Bonded Scissors,25.500,3,0.0,6.6300,1
1,6990,CA-2017-165099,12/11/2017,43082,First Class,DK-13375,Dennis Kane,Consumer,United States,Abilene,...,Central,OFF-AP-10001634,Office Supplies,Appliances,Hoover Commercial Lightweight Upright Vacuum,1.392,2,0.8,-3.7584,1
2,4324,US-2015-147662,2/14/2015,42054,Standard Class,KB-16315,Karl Braun,Consumer,United States,Akron,...,East,OFF-BI-10002160,Office Supplies,Binders,Acco Hanging Data Binders,2.286,2,0.7,-1.6764,1
3,3563,CA-2017-109757,9/4/2017,42987,Second Class,MD-17350,Maribeth Dona,Consumer,United States,Akron,...,East,OFF-BI-10001634,Office Supplies,Binders,Wilson Jones Active Use Binders,4.368,2,0.7,-3.0576,2
4,9922,CA-2014-111360,11/24/2014,41973,Standard Class,AT-10435,Alyssa Tate,Home Office,United States,Akron,...,East,OFF-BI-10003350,Office Supplies,Binders,Acco Expandable Hanging Binders,5.742,3,0.7,-4.5936,3

In [234]:
data.columns

Index(['Row ID', 'Order ID', 'Order Date', 'Ship Date', 'Ship Mode',
       'Customer ID', 'Customer Name', 'Segment', 'Country', 'City', 'State',
       'Postal Code', 'Region', 'Product ID', 'Category', 'Sub-Category',
       'Product Name', 'Sales', 'Quantity', 'Discount', 'Profit', 'rk'],
      dtype='object')

In [237]:
data.index

RangeIndex(start=0, stop=9694, step=1)

In [238]:
data[0:1]

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit,rk
0,9261,CA-2017-167976,11/11/2017,43053,Second Class,JL-15505,Jeremy Lonsdale,Consumer,United States,Aberdeen,...,Central,OFF-SU-10004661,Office Supplies,Supplies,Acme Titanium Bonded Scissors,25.5,3,0.0,6.63,1

In [241]:
type(data)

pandas.core.frame.DataFrame

In [242]:
data.dtypes

data structure  - data columns , data types

Row ID             int64
Order ID          object
Order Date        object
Ship Date          int64
Ship Mode         object
Customer ID       object
Customer Name     object
Segment           object
Country           object
City              object
State             object
Postal Code        int64
Region            object
Product ID        object
Category          object
Sub-Category      object
Product Name      object
Sales            float64
Quantity           int64
Discount         float64
Profit           float64
rk                 int64
dtype: object

In [ ]:
import pandas as pd
sample = pd.read_csv("file.csv")
sample.head()  - first few records
sample.tail()   - last few records
sample.columns - list columns
sample[index pass ] - rows - start value , e.v
pd.series() - create
pd.Dataframe ( input ) - create
sample.dtypes - data structre
sample.to_csv("sample.csv")

In [ ]:
1 D - one input , seires

In [ ]:
2 D or multi dimension - data frame

In [244]:
data

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit,rk
0,9261,CA-2017-167976,11/11/2017,43053,Second Class,JL-15505,Jeremy Lonsdale,Consumer,United States,Aberdeen,...,Central,OFF-SU-10004661,Office Supplies,Supplies,Acme Titanium Bonded Scissors,25.500,3,0.0,6.6300,1
1,6990,CA-2017-165099,12/11/2017,43082,First Class,DK-13375,Dennis Kane,Consumer,United States,Abilene,...,Central,OFF-AP-10001634,Office Supplies,Appliances,Hoover Commercial Lightweight Upright Vacuum,1.392,2,0.8,-3.7584,1
2,4324,US-2015-147662,2/14/2015,42054,Standard Class,KB-16315,Karl Braun,Consumer,United States,Akron,...,East,OFF-BI-10002160,Office Supplies,Binders,Acco Hanging Data Binders,2.286,2,0.7,-1.6764,1
3,3563,CA-2017-109757,9/4/2017,42987,Second Class,MD-17350,Maribeth Dona,Consumer,United States,Akron,...,East,OFF-BI-10001634,Office Supplies,Binders,Wilson Jones Active Use Binders,4.368,2,0.7,-3.0576,2
4,9922,CA-2014-111360,11/24/2014,41973,Standard Class,AT-10435,Alyssa Tate,Home Office,United States,Akron,...,East,OFF-BI-10003350,Office Supplies,Binders,Acco Expandable Hanging Binders,5.742,3,0.7,-4.5936,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9689,3348,CA-2015-112014,8/13/2015,42236,Standard Class,ON-18715,Odella Nelson,Corporate,United States,Yucaipa,...,West,OFF-AR-10003156,Office Supplies,Art,50 Colored Long Pencils,50.800,5,0.0,13.2080,1
9690,8088,CA-2016-106621,9/29/2016,42644,Second Class,DM-12955,Dario Medina,Corporate,United States,Yuma,...,West,OFF-AR-10002375,Office Supplies,Art,Newell 351,10.496,4,0.2,1.1808,1
9691,4823,CA-2016-134222,7/10/2016,42562,Same Day,NZ-18565,Nick Zandusky,Home Office,United States,Yuma,...,West,OFF-BI-10001658,Office Supplies,Binders,GBC Standard Therm-A-Bind Covers,44.856,6,0.7,-35.8848,2
9692,7280,CA-2016-108224,5/14/2016,42504,Same Day,TH-21235,Tiffany House,Corporate,United States,Yuma,...,West,TEC-AC-10003832,Technology,Accessories,Imation16GB Mini TravelDrive USB 2.0Flash Drive,185.528,7,0.2,48.7011,3
9693,7282,CA-2017-159282,10/16/2017,43029,Standard Class,GH-14410,Gary Hansen,Home Office,United States,Yuma,...,West,TEC-MA-10001148,Technology,Machines,Swingline SM12-08 MicroCut Jam Free Shredder,599.985,5,0.7,-479.9880,4

In [2]:
import pandas as pd
university = pd.read_csv("Universities.csv")
data = pd.read_exce("filename.xlsx",sheet_name = "sample")

In [3]:
university[0:2]

      Univ   SAT  Top10  Accept  SFRatio  Expenses  GradRate
0    Brown  1310     89      22       13     22704        94
1  CalTech  1415    100      25        6     63575        81

In [4]:
university.index

RangeIndex(start=0, stop=25, step=1)

In [249]:
university[0:10]

           Univ   SAT  Top10  Accept  SFRatio  Expenses  GradRate
0         Brown  1310     89      22       13     22704        94
1       CalTech  1415    100      25        6     63575        81
2           CMU  1260     62      59        9     25026        72
3      Columbia  1310     76      24       12     31510        88
4       Cornell  1280     83      33       13     21864        90
5     Dartmouth  1340     89      23       10     32162        95
6          Duke  1315     90      30       12     31585        95
7    Georgetown  1255     74      24       12     20126        92
8       Harvard  1400     91      14       11     39525        97
9  JohnsHopkins  1305     75      44        7     58691        87

In [5]:
university.columns

Index(['Univ', 'SAT', 'Top10', 'Accept', 'SFRatio', 'Expenses', 'GradRate'], dtype='object')

In [252]:
university["SAT"] - one square

0    1310
1    1415
2    1260
3    1310
4    1280
Name: SAT, dtype: int64

In [254]:
university[[ 'Top10', 'Accept', 'SFRatio'  ]][0:4]  - double sqaure

   Top10  Accept  SFRatio
0     89      22       13
1    100      25        6
2     62      59        9
3     76      24       12
4     83      33       13

In [255]:
university[0:5]

       Univ   SAT  Top10  Accept  SFRatio  Expenses  GradRate
0     Brown  1310     89      22       13     22704        94
1   CalTech  1415    100      25        6     63575        81
2       CMU  1260     62      59        9     25026        72
3  Columbia  1310     76      24       12     31510        88
4   Cornell  1280     83      33       13     21864        90

In [258]:
# create column

university["new"] = 'US'

In [259]:
university[0:3]

      Univ   SAT  Top10  Accept  SFRatio  Expenses  GradRate new
0    Brown  1310     89      22       13     22704        94  US
1  CalTech  1415    100      25        6     63575        81  US
2      CMU  1260     62      59        9     25026        72  US

In [260]:
university['old'] = ["IN","US","OP",....]

In [262]:
university[0:3]

      Univ   SAT  Top10  Accept  SFRatio  Expenses  GradRate new old
0    Brown  1310     89      22       13     22704        94  US  IN
1  CalTech  1415    100      25        6     63575        81  US  IN
2      CMU  1260     62      59        9     25026        72  US  IN

In [264]:
university.columns

Index(['Univ', 'SAT', 'Top10', 'Accept', 'SFRatio', 'Expenses', 'GradRate',
       'new', 'old'],
      dtype='object')

In [267]:
x = university[['new','Univ', 'SAT', 'Top10', 'Accept', 'SFRatio', 'Expenses', 'GradRate']][0:3]

In [268]:
x.columns

Index(['new', 'Univ', 'SAT', 'Top10', 'Accept', 'SFRatio', 'Expenses',
       'GradRate'],
      dtype='object')

In [269]:
university.T

,0,1,2,3,4,5,6,7,8,9,...,15,16,17,18,19,20,21,22,23,24
Univ,Brown,CalTech,CMU,Columbia,Cornell,Dartmouth,Duke,Georgetown,Harvard,JohnsHopkins,...,Purdue,Stanford,TexasA&M,UCBerkeley,UChicago,UMichigan,UPenn,UVA,UWisconsin,Yale
SAT,1310,1415,1260,1310,1280,1340,1315,1255,1400,1305,...,1005,1360,1075,1240,1290,1180,1285,1225,1085,1375
Top10,89,100,62,76,83,89,90,74,91,75,...,28,90,49,95,75,65,80,77,40,95
Accept,22,25,59,24,33,23,30,24,14,44,...,90,20,67,40,50,68,36,44,69,19
SFRatio,13,6,9,12,13,10,12,12,11,7,...,19,12,25,17,13,16,11,14,15,11
Expenses,22704,63575,25026,31510,21864,32162,31585,20126,39525,58691,...,9066,36450,8704,15140,38380,15470,27553,13349,11857,43514
GradRate,94,81,72,88,90,95,95,92,97,87,...,69,93,67,78,87,85,90,92,71,96
new,US,US,US,US,US,US,US,US,US,US,...,US,US,US,US,US,US,US,US,US,US
old,IN,IN,IN,IN,IN,IN,IN,IN,IN,IN,...,IN,IN,IN,IN,IN,IN,IN,IN,IN,IN

In [270]:
university.columns

Index(['Univ', 'SAT', 'Top10', 'Accept', 'SFRatio', 'Expenses', 'GradRate',
       'new', 'old'],
      dtype='object')

In [271]:
university[0:3]

      Univ   SAT  Top10  Accept  SFRatio  Expenses  GradRate new old
0    Brown  1310     89      22       13     22704        94  US  IN
1  CalTech  1415    100      25        6     63575        81  US  IN
2      CMU  1260     62      59        9     25026        72  US  IN

In [275]:
university.sort_values(['Univ'],ascending = False)[0:3]

          Univ   SAT  Top10  Accept  SFRatio  Expenses  GradRate new old
24        Yale  1375     95      19       11     43514        96  US  IN
23  UWisconsin  1085     40      69       15     11857        71  US  IN
22         UVA  1225     77      44       14     13349        92  US  IN

In [276]:
university.sort_values(['Univ','SAT'],ascending = True)[0:3]

      Univ   SAT  Top10  Accept  SFRatio  Expenses  GradRate new old
0    Brown  1310     89      22       13     22704        94  US  IN
2      CMU  1260     62      59        9     25026        72  US  IN
1  CalTech  1415    100      25        6     63575        81  US  IN

In [279]:
university["Univ"][0:4]

0       Brown
1     CalTech
2         CMU
3    Columbia
Name: Univ, dtype: object

In [280]:
university.loc[:,"Univ"]  - selection by label

0            Brown
1          CalTech
2              CMU
3         Columbia
4          Cornell
5        Dartmouth
6             Duke
7       Georgetown
8          Harvard
9     JohnsHopkins
10             MIT
11    Northwestern
12       NotreDame
13       PennState
14       Princeton
15          Purdue
16        Stanford
17        TexasA&M
18      UCBerkeley
19        UChicago
20       UMichigan
21           UPenn
22             UVA
23      UWisconsin
24            Yale
Name: Univ, dtype: object

In [282]:
university.loc[:,["Univ","SAT"]]

In [285]:
# selection by position


university.iloc[3:5]

       Univ   SAT  Top10  Accept  SFRatio  Expenses  GradRate new old
3  Columbia  1310     76      24       12     31510        88  US  IN
4   Cornell  1280     83      33       13     21864        90  US  IN

In [286]:
university.iloc[3:5,0:2]

       Univ   SAT
3  Columbia  1310
4   Cornell  1280

In [26]:
university[0:4]

NameError: name 'university' is not defined

In [288]:
df = university.copy()

In [289]:
df[0:3]

      Univ   SAT  Top10  Accept  SFRatio  Expenses  GradRate new old
0    Brown  1310     89      22       13     22704        94  US  IN
1  CalTech  1415    100      25        6     63575        81  US  IN
2      CMU  1260     62      59        9     25026        72  US  IN

In [291]:
# data operation or data querying 


df[0:4]

       Univ   SAT  Top10  Accept  SFRatio  Expenses  GradRate new old
0     Brown  1310     89      22       13     22704        94  US  IN
1   CalTech  1415    100      25        6     63575        81  US  IN
2       CMU  1260     62      59        9     25026        72  US  IN
3  Columbia  1310     76      24       12     31510        88  US  IN

In [ ]:
# filter or cond apply or query 

sytax:
df[  condition  ]

In [293]:
df[ df["Expenses"] > 30000  ][0:4]

        Univ   SAT  Top10  Accept  SFRatio  Expenses  GradRate new old
1    CalTech  1415    100      25        6     63575        81  US  IN
3   Columbia  1310     76      24       12     31510        88  US  IN
5  Dartmouth  1340     89      23       10     32162        95  US  IN
6       Duke  1315     90      30       12     31585        95  US  IN

In [294]:
df[ df["SAT"] == 1310 ]

       Univ   SAT  Top10  Accept  SFRatio  Expenses  GradRate new old
0     Brown  1310     89      22       13     22704        94  US  IN
3  Columbia  1310     76      24       12     31510        88  US  IN

In [295]:
df[ df["SAT"] == 1310 ]["Univ"]

0       Brown
3    Columbia
Name: Univ, dtype: object

In [301]:
university[ (university['Top10'] > 80)  ][["Univ","SAT"]][0:6]

        Univ   SAT
0      Brown  1310
1    CalTech  1415
4    Cornell  1280
5  Dartmouth  1340
6       Duke  1315
8    Harvard  1400

In [303]:
university["Univ"].unique()

array(['Brown', 'CalTech', 'CMU', 'Columbia', 'Cornell', 'Dartmouth',
       'Duke', 'Georgetown', 'Harvard', 'JohnsHopkins', 'MIT',
       'Northwestern', 'NotreDame', 'PennState', 'Princeton', 'Purdue',
       'Stanford', 'TexasA&M', 'UCBerkeley', 'UChicago', 'UMichigan',
       'UPenn', 'UVA', 'UWisconsin', 'Yale'], dtype=object)

In [13]:
sam = university[  university["Univ"].isin(["Yale","MIT"])  and (university.SFRatio == '11')]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [11]:
sam

Empty DataFrame
Columns: [Univ, SAT, Top10, Accept, SFRatio, Expenses, GradRate]
Index: []

In [308]:
len(university)

25

In [9]:
# missing values
import pandas as pd
ad = pd.read_csv("Advertising.csv")

In [10]:
ad

  Name   age   mobile no       city  marks  salary  Unnamed: 6  Unnamed: 7
0    A  50.0  9900763290  Bangalore    285   10818      2163.6       99007
1    B  23.0  9709303020     Mumbai    434   11506      2301.2       97093
2    C  22.0  9796840335        NaN    416   11506      2301.2       97968
3    D  47.0  9433821160        NaN    189   11506      2301.2       94338
4    E  33.0  9840448035        NaN    117   11506      2301.2       98404
5    F   NaN  9626621256    chennai    326   18206      3641.2       96266
6    G   NaN  9775317986   hydrabad    326   13755      2751.0       97753
7    H   NaN  9798357363   calcatta    326   11506      2301.2       97983
8    I  37.0  9338865840       pune    487   11339      2267.8       93388
9    J  50.0  9427086263     Mumbai    265   11506      2301.2       94270

In [11]:
ad['age']

0    50.0
1    23.0
2    22.0
3    47.0
4    33.0
5     NaN
6     NaN
7     NaN
8    37.0
9    50.0
Name: age, dtype: float64

In [19]:
ad['age'].fillna(37)

0    50.0
1    23.0
2    22.0
3    47.0
4    33.0
5    37.0
6    37.0
7    37.0
8    37.0
9    50.0
Name: age, dtype: float64

In [ ]:
missing values   -> mean (avg) , max , min , previous , median , mode

In [18]:
ad['age'].median()

37.0

In [21]:
ad['age'].fillna(33)

0    50.0
1    23.0
2    22.0
3    47.0
4    33.0
5    33.0
6    33.0
7    33.0
8    37.0
9    50.0
Name: age, dtype: float64

In [23]:
# 100000 , 10000  - missing %   2% , 5%

ad['age'].dropna()

0    50.0
1    23.0
2    22.0
3    47.0
4    33.0
8    37.0
9    50.0
Name: age, dtype: float64

In [32]:
university[0:4]

       Univ   SAT  Top10  Accept  SFRatio  Expenses  GradRate
0     Brown  1310     89      22       13     22704        94
1   CalTech  1415    100      25        6     63575        81
2       CMU  1260     62      59        9     25026        72
3  Columbia  1310     76      24       12     31510        88

In [28]:
ad

  Name   age   mobile no       city  marks  salary  Unnamed: 6  Unnamed: 7
0    A  50.0  9900763290  Bangalore    285   10818      2163.6       99007
1    B  23.0  9709303020     Mumbai    434   11506      2301.2       97093
2    C  22.0  9796840335        NaN    416   11506      2301.2       97968
3    D  47.0  9433821160        NaN    189   11506      2301.2       94338
4    E  33.0  9840448035        NaN    117   11506      2301.2       98404
5    F   NaN  9626621256    chennai    326   18206      3641.2       96266
6    G   NaN  9775317986   hydrabad    326   13755      2751.0       97753
7    H   NaN  9798357363   calcatta    326   11506      2301.2       97983
8    I  37.0  9338865840       pune    487   11339      2267.8       93388
9    J  50.0  9427086263     Mumbai    265   11506      2301.2       94270

In [33]:
ad['age'] = ad['age'].fillna('37')

In [34]:
ad['city'] = ad['city'].fillna('Bangalore')

In [35]:
ad

  Name   age   mobile no       city  marks  salary  Unnamed: 6  Unnamed: 7
0    A  50.0  9900763290  Bangalore    285   10818      2163.6       99007
1    B  23.0  9709303020     Mumbai    434   11506      2301.2       97093
2    C  22.0  9796840335  Bangalore    416   11506      2301.2       97968
3    D  47.0  9433821160  Bangalore    189   11506      2301.2       94338
4    E  33.0  9840448035  Bangalore    117   11506      2301.2       98404
5    F    37  9626621256    chennai    326   18206      3641.2       96266
6    G    37  9775317986   hydrabad    326   13755      2751.0       97753
7    H    37  9798357363   calcatta    326   11506      2301.2       97983
8    I  37.0  9338865840       pune    487   11339      2267.8       93388
9    J  50.0  9427086263     Mumbai    265   11506      2301.2       94270

In [36]:
d2 = ad[0:3]

In [37]:
ad = pd.concat([ad,d2])

In [38]:
ad

  Name   age   mobile no       city  marks  salary  Unnamed: 6  Unnamed: 7
0    A  50.0  9900763290  Bangalore    285   10818      2163.6       99007
1    B  23.0  9709303020     Mumbai    434   11506      2301.2       97093
2    C  22.0  9796840335  Bangalore    416   11506      2301.2       97968
3    D  47.0  9433821160  Bangalore    189   11506      2301.2       94338
4    E  33.0  9840448035  Bangalore    117   11506      2301.2       98404
5    F    37  9626621256    chennai    326   18206      3641.2       96266
6    G    37  9775317986   hydrabad    326   13755      2751.0       97753
7    H    37  9798357363   calcatta    326   11506      2301.2       97983
8    I  37.0  9338865840       pune    487   11339      2267.8       93388
9    J  50.0  9427086263     Mumbai    265   11506      2301.2       94270
0    A  50.0  9900763290  Bangalore    285   10818      2163.6       99007
1    B  23.0  9709303020     Mumbai    434   11506      2301.2       97093
2    C  22.0  9796840335  Bangalore    416   11506      2301.2       97968

In [39]:
ad.drop_duplicates()

  Name   age   mobile no       city  marks  salary  Unnamed: 6  Unnamed: 7
0    A  50.0  9900763290  Bangalore    285   10818      2163.6       99007
1    B  23.0  9709303020     Mumbai    434   11506      2301.2       97093
2    C  22.0  9796840335  Bangalore    416   11506      2301.2       97968
3    D  47.0  9433821160  Bangalore    189   11506      2301.2       94338
4    E  33.0  9840448035  Bangalore    117   11506      2301.2       98404
5    F    37  9626621256    chennai    326   18206      3641.2       96266
6    G    37  9775317986   hydrabad    326   13755      2751.0       97753
7    H    37  9798357363   calcatta    326   11506      2301.2       97983
8    I  37.0  9338865840       pune    487   11339      2267.8       93388
9    J  50.0  9427086263     Mumbai    265   11506      2301.2       94270

In [40]:
ad[:5]

  Name   age   mobile no       city  marks  salary  Unnamed: 6  Unnamed: 7
0    A  50.0  9900763290  Bangalore    285   10818      2163.6       99007
1    B  23.0  9709303020     Mumbai    434   11506      2301.2       97093
2    C  22.0  9796840335  Bangalore    416   11506      2301.2       97968
3    D  47.0  9433821160  Bangalore    189   11506      2301.2       94338
4    E  33.0  9840448035  Bangalore    117   11506      2301.2       98404

In [42]:
ad.drop_duplicates(['city','Name'])

  Name   age   mobile no       city  marks  salary  Unnamed: 6  Unnamed: 7
0    A  50.0  9900763290  Bangalore    285   10818      2163.6       99007
1    B  23.0  9709303020     Mumbai    434   11506      2301.2       97093
2    C  22.0  9796840335  Bangalore    416   11506      2301.2       97968
3    D  47.0  9433821160  Bangalore    189   11506      2301.2       94338
4    E  33.0  9840448035  Bangalore    117   11506      2301.2       98404
5    F    37  9626621256    chennai    326   18206      3641.2       96266
6    G    37  9775317986   hydrabad    326   13755      2751.0       97753
7    H    37  9798357363   calcatta    326   11506      2301.2       97983
8    I  37.0  9338865840       pune    487   11339      2267.8       93388
9    J  50.0  9427086263     Mumbai    265   11506      2301.2       94270

  Name   age   mobile no       city  marks  salary  Unnamed: 6  Unnamed: 7
0    A  50.0  9900763290  Bangalore    285   10818      2163.6       99007
1    B  23.0  9709303020     Mumbai    434   11506      2301.2       97093
2    C  22.0  9796840335  Bangalore    416   11506      2301.2       97968
3    D  47.0  9433821160  Bangalore    189   11506      2301.2       94338
4    E  33.0  9840448035  Bangalore    117   11506      2301.2       98404
5    F    37  9626621256    chennai    326   18206      3641.2       96266
6    G    37  9775317986   hydrabad    326   13755      2751.0       97753
7    H    37  9798357363   calcatta    326   11506      2301.2       97983
8    I  37.0  9338865840       pune    487   11339      2267.8       93388
9    J  50.0  9427086263     Mumbai    265   11506      2301.2       94270
0    A  50.0  9900763290  Bangalore    285   10818      2163.6       99007
1    B  23.0  9709303020     Mumbai    434   11506      2301.2       97093
2    C  22.0  9796840335  Bangalore    416   11506      2301.2       97968

In [44]:
data1 = ad.copy()

In [ ]:
# Pivot table

In [45]:
ad

  Name   age   mobile no       city  marks  salary  Unnamed: 6  Unnamed: 7
0    A  50.0  9900763290  Bangalore    285   10818      2163.6       99007
1    B  23.0  9709303020     Mumbai    434   11506      2301.2       97093
2    C  22.0  9796840335  Bangalore    416   11506      2301.2       97968
3    D  47.0  9433821160  Bangalore    189   11506      2301.2       94338
4    E  33.0  9840448035  Bangalore    117   11506      2301.2       98404
5    F    37  9626621256    chennai    326   18206      3641.2       96266
6    G    37  9775317986   hydrabad    326   13755      2751.0       97753
7    H    37  9798357363   calcatta    326   11506      2301.2       97983
8    I  37.0  9338865840       pune    487   11339      2267.8       93388
9    J  50.0  9427086263     Mumbai    265   11506      2301.2       94270
0    A  50.0  9900763290  Bangalore    285   10818      2163.6       99007
1    B  23.0  9709303020     Mumbai    434   11506      2301.2       97093
2    C  22.0  9796840335  Bangalore    416   11506      2301.2       97968

In [48]:
len(ad[  ad.duplicated()  ])

3

In [ ]:
# interview - duplicate , missing treat

In [57]:
# Pivot table

ad[0:3]

  Name   age   mobile no       city  marks  salary  Unnamed: 6  Unnamed: 7
0    A  50.0  9900763290  Bangalore    285   10818      2163.6       99007
1    B  23.0  9709303020     Mumbai    434   11506      2301.2       97093
2    C  22.0  9796840335  Bangalore    416   11506      2301.2       97968

In [60]:
ad.groupby(['city'],as_index=False)['salary','marks'].sum()

C:\Users\Admin\AppData\Local\Temp\ipykernel_15796\35803648.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  ad.groupby(['city'],as_index=False)['salary','marks'].sum()

        city  salary  marks
0  Bangalore   67660   1708
1     Mumbai   34518   1133
2   calcatta   11506    326
3    chennai   18206    326
4   hydrabad   13755    326
5       pune   11339    487

In [52]:
ad.groupby(['city'],as_index=False)['salary'].mean()

        city        salary
0  Bangalore  11276.666667
1     Mumbai  11506.000000
2   calcatta  11506.000000
3    chennai  18206.000000
4   hydrabad  13755.000000
5       pune  11339.000000

In [61]:
ad.groupby(['city'],as_index=False)['salary'].count()

        city  salary
0  Bangalore       6
1     Mumbai       3
2   calcatta       1
3    chennai       1
4   hydrabad       1
5       pune       1

In [64]:
table1 = ad[0:3]

In [65]:
table1['customer_id'] = [1,2,3]

C:\Users\Admin\AppData\Local\Temp\ipykernel_15796\3907091986.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  table1['customer_id'] = [1,2,3]

In [66]:
table1

,Name,age,mobile no,city,marks,salary,Unnamed: 6,Unnamed: 7,customer_id
0,A,50.0,9900763290,Bangalore,285,10818,2163.6,99007,1
1,B,23.0,9709303020,Mumbai,434,11506,2301.2,97093,2
2,C,22.0,9796840335,Bangalore,416,11506,2301.2,97968,3

In [70]:
table2 = ad[['city','age']][4:7]

In [72]:
table2['customer_id'] = [2,4,3]

In [77]:
table1 = table1.drop(['Unnamed: 6','Unnamed: 7'],axis=1)

In [78]:
table1

  Name   mobile no  marks  salary  customer_id
0    A  9900763290    285   10818            1
1    B  9709303020    434   11506            2
2    C  9796840335    416   11506            3

In [79]:
table2  - 3    , table1 - 3

        city   age  customer_id
4  Bangalore  33.0            2
5    chennai    37            4
6   hydrabad    37            3

In [81]:
# pkey - customer_id , skey - custoem_id

left = pd.merge(table1,table2,how='left',left_on='customer_id',right_on='customer_id')

In [82]:
left

  Name   mobile no  marks  salary  customer_id       city   age
0    A  9900763290    285   10818            1        NaN   NaN
1    B  9709303020    434   11506            2  Bangalore  33.0
2    C  9796840335    416   11506            3   hydrabad    37

In [83]:
table1 - 1,2,3

  Name   mobile no  marks  salary  customer_id
0    A  9900763290    285   10818            1
1    B  9709303020    434   11506            2
2    C  9796840335    416   11506            3

In [85]:
table2['dependend_id'] = table2['customer_id']

In [86]:
table2

        city   age  customer_id  dependend_id
4  Bangalore  33.0            2             2
5    chennai    37            4             4
6   hydrabad    37            3             3

In [89]:

right = pd.merge(table1,table2,how='right',left_on='customer_id',right_on='customer_id')

In [90]:
right

,Name,mobile no,marks,salary,customer_id,city,age,dependend_id
0,B,9.709303e+09,434.0,11506.0,2,Bangalore,33.0,2
1,NaN,NaN,NaN,NaN,4,chennai,37,4
2,C,9.796840e+09,416.0,11506.0,3,hydrabad,37,3

In [91]:

inner = pd.merge(table1,table2,how='inner',left_on='customer_id',right_on='customer_id')

In [92]:
inner

  Name   mobile no  marks  salary  customer_id       city   age  dependend_id
0    B  9709303020    434   11506            2  Bangalore  33.0             2
1    C  9796840335    416   11506            3   hydrabad    37             3

In [93]:
outer = pd.merge(table1,table2,how='outer',left_on=['customer_id','city'],right_on=['customer_id','city]')

In [94]:
outer

,Name,mobile no,marks,salary,customer_id,city,age,dependend_id
0,A,9.900763e+09,285.0,10818.0,1,NaN,NaN,NaN
1,B,9.709303e+09,434.0,11506.0,2,Bangalore,33.0,2.0
2,C,9.796840e+09,416.0,11506.0,3,hydrabad,37,3.0
3,NaN,NaN,NaN,NaN,4,chennai,37,4.0

In [97]:
d1 = ad[0:3]
d2 = ad[4:7]

In [98]:
d1

  Name   age   mobile no       city  marks  salary  Unnamed: 6  Unnamed: 7
0    A  50.0  9900763290  Bangalore    285   10818      2163.6       99007
1    B  23.0  9709303020     Mumbai    434   11506      2301.2       97093
2    C  22.0  9796840335  Bangalore    416   11506      2301.2       97968

In [99]:
d2

  Name   age   mobile no       city  marks  salary  Unnamed: 6  Unnamed: 7
4    E  33.0  9840448035  Bangalore    117   11506      2301.2       98404
5    F    37  9626621256    chennai    326   18206      3641.2       96266
6    G    37  9775317986   hydrabad    326   13755      2751.0       97753

In [100]:
# ROW WISE - APPEND ,CONCAT

result = pd.concat([d1,d2])

In [101]:
result

  Name   age   mobile no       city  marks  salary  Unnamed: 6  Unnamed: 7
0    A  50.0  9900763290  Bangalore    285   10818      2163.6       99007
1    B  23.0  9709303020     Mumbai    434   11506      2301.2       97093
2    C  22.0  9796840335  Bangalore    416   11506      2301.2       97968
4    E  33.0  9840448035  Bangalore    117   11506      2301.2       98404
5    F    37  9626621256    chennai    326   18206      3641.2       96266
6    G    37  9775317986   hydrabad    326   13755      2751.0       97753

In [102]:
d1

  Name   age   mobile no       city  marks  salary  Unnamed: 6  Unnamed: 7
0    A  50.0  9900763290  Bangalore    285   10818      2163.6       99007
1    B  23.0  9709303020     Mumbai    434   11506      2301.2       97093
2    C  22.0  9796840335  Bangalore    416   11506      2301.2       97968

In [105]:
d1.append(d1[0:1])

C:\Users\Admin\AppData\Local\Temp\ipykernel_15796\2968613278.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  d1.append(d1[0:1])

  Name   age   mobile no       city  marks  salary  Unnamed: 6  Unnamed: 7
0    A  50.0  9900763290  Bangalore    285   10818      2163.6       99007
1    B  23.0  9709303020     Mumbai    434   11506      2301.2       97093
2    C  22.0  9796840335  Bangalore    416   11506      2301.2       97968
0    A  50.0  9900763290  Bangalore    285   10818      2163.6       99007

In [107]:
d1

  Name   age   mobile no       city  marks  salary  Unnamed: 6  Unnamed: 7
0    A  50.0  9900763290  Bangalore    285   10818      2163.6       99007
1    B  23.0  9709303020     Mumbai    434   11506      2301.2       97093
2    C  22.0  9796840335  Bangalore    416   11506      2301.2       97968

In [109]:
d1[ d1['city'] != 'Mumbai' ]

  Name   age   mobile no       city  marks  salary  Unnamed: 6  Unnamed: 7
0    A  50.0  9900763290  Bangalore    285   10818      2163.6       99007
2    C  22.0  9796840335  Bangalore    416   11506      2301.2       97968

In [111]:
ad

  Name   age   mobile no       city  marks  salary  Unnamed: 6  Unnamed: 7
0    A  50.0  9900763290  Bangalore    285   10818      2163.6       99007
1    B  23.0  9709303020     Mumbai    434   11506      2301.2       97093
2    C  22.0  9796840335  Bangalore    416   11506      2301.2       97968
3    D  47.0  9433821160  Bangalore    189   11506      2301.2       94338
4    E  33.0  9840448035  Bangalore    117   11506      2301.2       98404
5    F    37  9626621256    chennai    326   18206      3641.2       96266
6    G    37  9775317986   hydrabad    326   13755      2751.0       97753
7    H    37  9798357363   calcatta    326   11506      2301.2       97983
8    I  37.0  9338865840       pune    487   11339      2267.8       93388
9    J  50.0  9427086263     Mumbai    265   11506      2301.2       94270
0    A  50.0  9900763290  Bangalore    285   10818      2163.6       99007
1    B  23.0  9709303020     Mumbai    434   11506      2301.2       97093
2    C  22.0  9796840335  Bangalore    416   11506      2301.2       97968

In [117]:
ad[ ~ ad['city'].isin(['Bangalore','Mumbai']) ]

  Name   age   mobile no      city  marks  salary  Unnamed: 6  Unnamed: 7
5    F    37  9626621256   chennai    326   18206      3641.2       96266
6    G    37  9775317986  hydrabad    326   13755      2751.0       97753
7    H    37  9798357363  calcatta    326   11506      2301.2       97983
8    I  37.0  9338865840      pune    487   11339      2267.8       93388

In [118]:
table1

  Name   mobile no  marks  salary  customer_id
0    A  9900763290    285   10818            1
1    B  9709303020    434   11506            2
2    C  9796840335    416   11506            3

In [123]:
match = table1['customer_id'].unique()

In [124]:
match

array([1, 2, 3], dtype=int64)

In [126]:
table2[ table2['customer_id'].isin(match) ]['age']

4    33.0
6      37
Name: age, dtype: object

In [132]:
x= table2[ table2['customer_id'].isin(table1['customer_id']) ][['age','city']]

In [ ]:
# table2 - table1 customer id match - age 


table2[  table2['customer_id'].isin(table1['cutomer_id']) ]

In [ ]:
table1 , table2 , table3

In [ ]:
res = pd.merge(table1,table2,how= 'left', pkey = skey)

In [ ]:
final = pd.merge(res,table3,how='inner',pkey = , skey = )

In [ ]:
Task1:
    
    
    1.two table join , pkey = trans_id , skey = parent_id ( table1 = 4 , table2 = 5)
    2.task1 duplicates records ( table1 = 5 ( 1 duplicates) , table2 = 5)

In [135]:
table1.append(table1[0:1])

C:\Users\Admin\AppData\Local\Temp\ipykernel_15796\3387098415.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  table1.append(table1[0:1])

  Name   mobile no  marks  salary  customer_id
0    A  9900763290    285   10818            1
1    B  9709303020    434   11506            2
2    C  9796840335    416   11506            3
0    A  9900763290    285   10818            1

In [134]:
table2

        city   age  customer_id  dependend_id
4  Bangalore  33.0            2             2
5    chennai    37            4             4
6   hydrabad    37            3             3

In [16]:
university[:3]

      Univ   SAT  Top10  Accept  SFRatio  Expenses  GradRate
0    Brown  1310     89      22       13     22704        94
1  CalTech  1415    100      25        6     63575        81
2      CMU  1260     62      59        9     25026        72

In [17]:
movie = pd.read_csv("df.csv")

In [18]:
movie

   Date    name movie     status  collection  budget
0  1990  rajini  Baba        hit         100      50
1  1991   kamal    m1        hit         100      60
2  1992  rajini    m2  super hit         200      50
3  1993  vikram    m3  super hit         100      50

In [ ]:
name = rajini , status = hit , budget = 50 , collection > 50

In [20]:
import numpy as np
import pandas as pd

In [21]:
movie['new'] = np.where(  (movie['name'] == "rajini") & (movie['status'] == 'hit') &
                          (movie['budget'] == 50) & (movie['collection'] > 50) , 'yes' , 'no'   )

In [24]:
movie[movie['new'] == "yes"]

   Date    name movie status  collection  budget  new
0  1990  rajini  Baba    hit         100      50  yes

In [25]:
movie[movie['new'] == "no"]

   Date    name movie     status  collection  budget new
1  1991   kamal    m1        hit         100      60  no
2  1992  rajini    m2  super hit         200      50  no
3  1993  vikram    m3  super hit         100      50  no

In [27]:
from sqlalchemy import create_engine
msql = create_engin(host,port,database = "mssql")
msql = create_engin(10.23.5.45,3040,database = "mssql",username = "thillai",pwd="pasa44")


# Data base connect - mssql , oracle , sap , postgres

In [ ]:
pd.read_sql_query("select * from table",msql )

In [ ]:
pd.read_table("sample",msql)

In [ ]:
# Datetime

Date , month , year , date , format , differ

In [50]:
# Datetime

import pandas as pd

# Create dates dataframe with frequency
data = pd.date_range('1/1/2023', periods = 10)

data

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08',
               '2023-01-09', '2023-01-10'],
              dtype='datetime64[ns]', freq='D')

In [51]:
df = pd.DataFrame({'year': [2015, 2016],
                   'month': [2, 3],
                   'day': [4, 5]})
pd.to_datetime(df)

0   2015-02-04
1   2016-03-05
dtype: datetime64[ns]

In [52]:
pd.to_datetime(1490195805, unit='s')

Timestamp('2017-03-22 15:16:45')

0   2015-02-04
1   2016-03-05
dtype: datetime64[ns]

In [31]:

# Timestamp('2017-03-22 15:16:45')
pd.to_datetime(1490195805433502912, unit='ns')
# Timestamp('2017-03-22 15:16:45.433502912')

Timestamp('2017-03-22 15:16:45.433502912')

In [53]:
pd.to_datetime([1, 2, 3], unit='D',
               origin=pd.Timestamp('1960-01-01'))

DatetimeIndex(['1960-01-02', '1960-01-03', '1960-01-04'], dtype='datetime64[ns]', freq=None)

In [54]:
pd.to_datetime('2018-10-26 12:00:00.0000000011',
               format='%Y-%m-%d %H:%M:%S.%f')

Timestamp('2018-10-26 12:00:00.000000001')

In [55]:
pd.to_datetime('2018-10-26 12:00:00.0000000011',
               format='%Y-%m-%d %H:%M')

Timestamp('2018-10-26 12:00:00.000000001')

In [60]:
pd.to_datetime('2018-10-26',
               format='%Y-%m-%d')

Timestamp('2018-10-26 00:00:00')

In [61]:
pd.to_datetime('13000101', format='%Y%m%d', errors='ignore')

datetime.datetime(1300, 1, 1, 0, 0)

In [62]:
pd.to_datetime('13000101', format='%Y%m%d', errors='coerce')

NaT

In [34]:
pd.to_datetime('13000101', format='%Y%m%d', errors='ignore')
# '13000101'
pd.to_datetime('13000101', format='%Y%m%d', errors='coerce')

NaT

In [35]:
pd.to_datetime(['2018-10-26 12:00:00', '2018-10-26 13:00:15'])

DatetimeIndex(['2018-10-26 12:00:00', '2018-10-26 13:00:15'], dtype='datetime64[ns]', freq=None)

In [37]:
pd.to_datetime(['2018-10-26 12:00 -0500', '2018-10-26 13:00 -0500'])

DatetimeIndex(['2018-10-26 12:00:00-05:00', '2018-10-26 13:00:00-05:00'], dtype='datetime64[ns, pytz.FixedOffset(-300)]', freq=None)

In [38]:
pd.to_datetime(['2020-10-25 02:00 +0200', '2020-10-25 04:00 +0100'])

Index([2020-10-25 02:00:00+02:00, 2020-10-25 04:00:00+01:00], dtype='object')

In [63]:
from datetime import datetime
pd.to_datetime(["2020-01-01 01:00:00-01:00", datetime(2020, 1, 1, 3, 0)])

pd.to_datetime(['2018-10-26 12:00', datetime(2020, 1, 1, 18)], utc=True)

DatetimeIndex(['2018-10-26 12:00:00+00:00', '2020-01-01 18:00:00+00:00'], dtype='datetime64[ns, UTC]', freq=None)

In [64]:
import pandas as pd

# Create dates dataframe with frequency
data = pd.date_range('1/1/2011', periods = 10, freq ='H')

data

DatetimeIndex(['2011-01-01 00:00:00', '2011-01-01 01:00:00',
               '2011-01-01 02:00:00', '2011-01-01 03:00:00',
               '2011-01-01 04:00:00', '2011-01-01 05:00:00',
               '2011-01-01 06:00:00', '2011-01-01 07:00:00',
               '2011-01-01 08:00:00', '2011-01-01 09:00:00'],
              dtype='datetime64[ns]', freq='H')

In [65]:
# Create date and time with dataframe
data = pd.date_range('1/1/2011', periods = 10, freq ='H')

x = pd.datetime.now()
x.month, x.year

C:\Users\Admin\AppData\Local\Temp\ipykernel_11032\1416622267.py:4: FutureWarning: The pandas.datetime class is deprecated and will be removed from pandas in a future version. Import from datetime module instead.
  x = pd.datetime.now()

(4, 2023)

In [66]:
# Create date and time with dataframe
rng = pd.DataFrame()
rng['date'] = pd.date_range('1/1/2011', periods = 72, freq ='H')

# Print the dates in dd-mm-yy format
rng[:5]

# Create features for year, month, day, hour, and minute
rng['year'] = rng['date'].dt.year
rng['month'] = rng['date'].dt.month
rng['day'] = rng['date'].dt.day
rng['hour'] = rng['date'].dt.hour
rng['minute'] = rng['date'].dt.minute

# Print the dates divided into features
rng.head(3)

                 date  year  month  day  hour  minute
0 2011-01-01 00:00:00  2011      1    1     0       0
1 2011-01-01 01:00:00  2011      1    1     1       0
2 2011-01-01 02:00:00  2011      1    1     2       0

In [46]:
# Input present datetime using Timestamp
# t = pd.tslib.Timestamp.now()
# t